In [1]:
import pyodbc

In [ ]:
# TODO TCP/IP
# TODO WireShark

In [2]:
mdb_path = "./database.mdb"
driver = '{Microsoft Access Driver (*.mdb, *.accdb)}'
conn_str = f"DRIVER={driver};DBQ={mdb_path};"

cnxn = pyodbc.connect(conn_str)
cursor = cnxn.cursor()

In [3]:
cursor.execute("DROP TABLE DATA_TABLE")

In [4]:
# cursor.execute("""
# CREATE TABLE DATA_TABLE (
#     id INTEGER PRIMARY KEY,
#     DATA01 FLOAT, DATA02 FLOAT,
#     DATA03 FLOAT, DATA04 FLOAT,
#     DATA05 FLOAT, DATA06 FLOAT,  
#     DATA07 FLOAT, DATA08 FLOAT,
#     DATA09 FLOAT
# );
# """)

In [5]:
start_query = "CREATE TABLE DATA_TABLE ("
id_query = "id INTEGER PRIMARY KEY, "
data_query = [f"DATA0{i} FLOAT" for i in range(1, 10)]
data_query = ", ".join(data_query)
end_query = ");"

tot_query = start_query + id_query + data_query + end_query
print(tot_query)

cursor.execute(tot_query)

CREATE TABLE DATA_TABLE (id INTEGER PRIMARY KEY, DATA01 FLOAT, DATA02 FLOAT, DATA03 FLOAT, DATA04 FLOAT, DATA05 FLOAT, DATA06 FLOAT, DATA07 FLOAT, DATA08 FLOAT, DATA09 FLOAT);

In [6]:
# excute once
# start_query = "INSERT INTO DATA_TABLE "
# id_query = "(id, "

# data_query = [f"DATA0{i}" for i in range(1, 10)]
# data_query = ", ".join(data_query)

# values_query = ") VALUES (1, "
# values_str = [f"{i}" for i in range(1, 10)]
# values_str = ", ".join(values_str)
# end_query = ")"

# tot_query = start_query + id_query + data_query + values_query + values_str + end_query
# print(tot_query)

# cursor.execute(tot_query)

In [7]:
# excute k times
for k in range(1, 10):
    start_query = "INSERT INTO DATA_TABLE "
    id_query = "(id, "

    data_query = [f"DATA0{i}" for i in range(1, 10)]
    data_query = ", ".join(data_query)

    values_query = f") VALUES ({k}, "
    values_str = [f"{i}" for i in range(1, 10)]
    values_str = ", ".join(values_str)
    end_query = ")"

    tot_query = start_query + id_query + data_query + values_query + values_str + end_query
    print(tot_query)

    cursor.execute(tot_query)

INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (1, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (2, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (3, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (4, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (5, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (6, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (7, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (8, 1, 2, 3, 4, 5, 6, 7, 8, 9)
INSERT INTO DATA_TABLE (id, DATA01, DATA02, DATA03, DATA04, DATA05, DATA06, DATA07, DATA08, DATA09) VALUES (9, 1, 2, 3, 4, 5, 6, 7, 8, 9)

In [8]:
cnxn.commit()

In [9]:
cursor.execute("SELECT * FROM DATA_TABLE")

for row in cursor:
    print(row)

(1, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(2, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(3, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(4, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(5, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(6, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(7, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(8, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)
(9, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0)

- Reference

https://blog.naver.com/cjinnnn/223047261231